Config/DataProcessors/LoadCurrencyRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>LoadCurrencyRates</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrencyRatesSource</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CurrencyRatesSources</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InternetConnectionSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.InternetConnectionSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Currencies</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/CurrencyRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CurrencyRates</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Rate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TravellerChequeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Factor</Name>
					<Comment>Кратность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BonusRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/DataProcessors/LoadCurrencyRates/Forms/tcDPSettings/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)  
	vObj = FormAttributeToValue("Object");
	vDataProcessor = Undefined;
	If Parameters.Property("DataProcessor", vDataProcessor) Then
		vObj.DataProcessor = vDataProcessor;
	EndIf;
	
	vObj.pmLoadDataProcessorAttributes();
	vObj.pmFillCurrenciesList();
	ValueToFormAttribute(vObj, "Object"); 
	
	vCurrList = vObj.Currencies.UnloadColumn("Currency"); 
	
	CurrencyRates.Parameters.SetParameterValue("qListCurr", vCurrList);
	CurrencyRates.Parameters.SetParameterValue("qHotel", Object.Hotel);
	CurrencyRates.Parameters.SetParameterValue("qRPer", Object.PeriodTo);
EndProcedure

#EndRegion 

#Region FormCommandsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure ExecuteF(pCommand)
	ExecuteAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure Clear(pCommand)
	CurrencyRates.Filter.Items.Clear();
	Items.CurrencyRates.Refresh();
	CurrencyRates.Parameters.SetParameterValue("qListCurr", Undefined);
	CurrencyRates.Parameters.SetParameterValue("qHotel", Undefined);
	CurrencyRates.Parameters.SetParameterValue("qRPer", Undefined);
	ClearServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure ChoosePeriodClick(pCommand)
	vChoosePeriodDialog = New StandardPeriodEditDialog();
	vChoosePeriodDialog.Period.StartDate = Object.PeriodFrom;
	vChoosePeriodDialog.Period.EndDate = Object.PeriodTo;
	vChoosePeriodDialog.Period.Variant = StandardPeriodVariant.Custom;
	vChoosePeriodDialog.Show(New NotifyDescription("ChoosePeriodAfterChoice", ThisObject));   
	ChoosePeriodClickAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure FillCurrenciesListAction(pCommand)
	If (Object.PeriodFrom > Object.PeriodTo) Then 
		vMessage = NStr("en = 'Incorrect dates settings!'; de = 'Falsche Datumseinstellungen!'; ru = 'Некорректно введены даты!'");
        tcCommonFunctionOnClientServer.UserMessage(vMessage);
		Return;
	EndIf;
	FillCurrenciesListActionAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SaveAttributesSetting(pCommand)
	SaveAttributesSettingAtServer();
EndProcedure 

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
&AtServer
Procedure FillCurrenciesListActionAtServer()
	vObj = FormAttributeToValue("Object");
	vObj.pmLoadDataProcessorAttributes();
	vObj.pmFillCurrenciesList();
	ValueToFormAttribute(vObj, "Object");
	
	vCurrList = vObj.Currencies.UnloadColumn("Currency");
	CurrencyRates.Parameters.SetParameterValue("qListCurr", vCurrList);
	CurrencyRates.Parameters.SetParameterValue("qHotel", Object.Hotel);
	CurrencyRates.Parameters.SetParameterValue("qRPer", Object.PeriodTo);
EndProcedure 

// --------------------------------------------------------------------------------
&AtServer
Procedure ClearServer()
	CurrencyRates.Filter.Items.Clear();
	Items.CurrencyRates.Refresh();
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure ChoosePeriodClickAtServer()
	PeriodFrom = BegOfDay(Object.PeriodFrom);
	PeriodTo = EndOfDay(Object.PeriodTo);
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure ChoosePeriodAfterChoice(pPeriod, pExtraParams) Export
	If pPeriod <> Undefined Then
		Object.PeriodFrom = pPeriod.StartDate;
		Object.PeriodTo = pPeriod.EndDate;
	EndIf;
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure ExecuteAtServer()
	If Object.Currencies.Count() = 0 Then      
		vText = NStr("en = 'Fill currencies list!'; de = 'Währungsliste ausfüllen!'; ru = 'Заполните список валют!'");
		tcCommonFunctionOnClientServer.UserMessage(vText);
		Return;
	EndIf;	
	vObj = FormAttributeToValue("Object");
	// Load rates interactively
	vObj.pmLoadCurrencyRates(True);
	ValueToFormAttribute(vObj, "Object");
	// Refresh rates in the list 
	RefreshCurrencyRates();
	Items.CurrencyRates.Refresh();
	
EndProcedure

// --------------------------------------------------------------------------------   
&AtServer
Procedure RefreshCurrencyRates()
	ActualCurrencyRates = InformationRegisters.CurrencyRates.SliceLast( , New Structure("Hotel", Object.Hotel));
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SaveAttributesSettingAtServer()
	vObj = FormAttributeToValue("Object");
	vObj.pmSaveDataProcessorAttributes();
EndProcedure 

#EndRegion
